{
  "idx2token": [
    "Y",
    "IH0",
    "R",
    "CH",
    "AE1",
    "V",
    "AA1",
    "<BOS>",
    "EY1",
    "EH0",
    "ER2",
    "B",
    "foreign",
    "AW1",
    "#",
    "OW2",
    "AY2",
    "L",
    "DH",
    "AO2",
    "OW0",
    "UH1",
    "AE0",
    "<EOS>",
    "G",
    "IY2",
    "JH",
    "UH2",
    "Z",
    "P",
    "AY1",
    "N",
    "AH2",
    "S",
    "french",
    "AW0",
    "SH",
    "AO0",
    "UW1",
    "TH",
    "EY0",
    "EH2",
    "AW2",
    "UW2",
    "AE2",
    "AA0",
    "IH1",
    "OY2",
    "AH1",
    "HH",
    "OW1",
    "IY1",
    "AH0",
    "D",
    "IH2",
    "UH0",
    "OY0",
    "AO1",
    "W",
    "ZH",
    "AA2",
    "IY0",
    "F",
    "AY0",
    "EH1",
    "M",
    "UW0",
    "<PAD>",
    "T",
    "ER1",
    "OY1",
    "ER0",
    "<UNK>",
    "K",
    "EY2",
    "NG"
  ],
  "special_tokens": [
    "<PAD>",
    "<BOS>",
    "<UNK>",
    "<EOS>"
  ],
  "token2idx": {
    "Y": 0,
    "IH0": 1,
    "R": 2,
    "CH": 3,
    "AE1": 4,
    "V": 5,
    "AA1": 6,
    "<BOS>": 7,
    "EY1": 8,
    "EH0": 9,
    "ER2": 10,
    "B": 11,
    "foreign": 12,
    "AW1": 13,
    "#": 14,
    "OW2": 15,
    "AY2": 16,
    "L": 17,
    "DH": 18,
    "AO2": 19,
    "OW0": 20,
    "UH1": 21,
    "AE0": 22,
    "<EOS>": 23,
    "G": 24,
    "IY2": 25,
    "JH": 26,
    "UH2": 27,
    "Z": 28,
    "P": 29,
    "AY1": 30,
    "N": 31,
    "AH2": 32,
    "S": 33,
    "french": 34,
    "AW0": 35,
    "SH": 36,
    "AO0": 37,
    "UW1": 38,
    "TH": 39,
    "EY0": 40,
    "EH2": 41,
    "AW2": 42,
    "UW2": 43,
    "AE2": 44,
    "AA0": 45,
    "IH1": 46,
    "OY2": 47,
    "AH1": 48,
    "HH": 49,
    "OW1": 50,
    "IY1": 51,
    "AH0": 52,
    "D": 53,
    "IH2": 54,
    "UH0": 55,
    "OY0": 56,
    "AO1": 57,
    "W": 58,
    "ZH": 59,
    "AA2": 60,
    "IY0": 61,
    "F": 62,
    "AY0": 63,
    "EH1": 64,
    "M": 65,
    "UW0": 66,
    "<PAD>": 67,
    "T": 68,
    "ER1": 69,
    "OY1": 70,
    "ER0": 71,
    "<UNK>": 72,
    "K": 73,
    "EY2": 74,
    "NG": 75
  }
}